# Дано дійсні числа: a,b,c,d .З’ясувати, чи належать ці числа інтервалу [1;2] перетин [c;d]
# 0 введення
"""
дійсні числа - float - a, b, c, d

"""
a = float(input("введіть 1-е число: "))
b = float(input("введіть 2-е число: "))
c = float(input("введіть 3-є число: "))
d = float(input("введіть 4-е число: "))
if 1 <= a <= 2 and c <= a <= d:
    print("а належить інтервалу [1,2] (перетин) [{0}, {1}]".format(c, d))
else:
    print("а не належить інтервалу [1,2] (перетин) [{0}, {1}]".format(c, d))
if 1 <= b <= 2 and c <= b <= d:
    print("b належить інтервалу [1,2] (перетин) [{0}, {1}]".format(c, d))
else:
    print("b  не належить інтервалу [1,2] (перетин) [{0}, {1}]".format(c, d))
if 1 <= c <= 2 and c <= c <= d:
    print("c належить інтервалу [1,2] (перетин) [{0}, {1}]".format(c, d))
else:
    print("c  не належить інтервалу [1,2] (перетин) [{0}, {1}]".format(c, d))
if 1 <= d <= 2 and c <= d <= d:
    print("d належить інтервалу [1,2] (перетин) [{0}, {1}]".format(c, d))
else:
    print("d  не належить інтервалу [1,2] (перетин) [{0}, {1}]".format(c, d))
